; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=378, out_folder=./training, instance_id=86, seed=2110, goal_proportion=0.03

(define (problem blocksworld-86)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 - object)
 (:init 
    (arm-empty)
    (clear b118)
    (on b118 b133)
    (on b133 b119)
    (on b119 b321)
    (on b321 b104)
    (on b104 b107)
    (on b107 b307)
    (on b307 b235)
    (on b235 b126)
    (on b126 b374)
    (on b374 b364)
    (on-table b364)
    (clear b211)
    (on b211 b190)
    (on b190 b215)
    (on b215 b279)
    (on b279 b288)
    (on b288 b33)
    (on-table b33)
    (clear b139)
    (on b139 b147)
    (on-table b147)
    (clear b138)
    (on b138 b245)
    (on-table b245)
    (clear b206)
    (on b206 b334)
    (on-table b334)
    (clear b347)
    (on b347 b335)
    (on b335 b90)
    (on b90 b99)
    (on b99 b196)
    (on b196 b78)
    (on b78 b322)
    (on-table b322)
    (clear b30)
    (on b30 b67)
    (on b67 b24)
    (on b24 b56)
    (on-table b56)
    (clear b174)
    (on-table b174)
    (clear b208)
    (on b208 b327)
    (on b327 b153)
    (on b153 b66)
    (on b66 b187)
    (on b187 b178)
    (on b178 b166)
    (on b166 b23)
    (on b23 b287)
    (on b287 b352)
    (on b352 b361)
    (on b361 b345)
    (on b345 b134)
    (on b134 b39)
    (on b39 b95)
    (on b95 b318)
    (on b318 b338)
    (on-table b338)
    (clear b87)
    (on-table b87)
    (clear b241)
    (on b241 b36)
    (on b36 b269)
    (on b269 b142)
    (on b142 b243)
    (on b243 b79)
    (on b79 b14)
    (on b14 b128)
    (on b128 b246)
    (on b246 b17)
    (on b17 b181)
    (on b181 b309)
    (on b309 b63)
    (on-table b63)
    (clear b116)
    (on-table b116)
    (clear b316)
    (on-table b316)
    (clear b344)
    (on b344 b227)
    (on b227 b160)
    (on b160 b47)
    (on-table b47)
    (clear b324)
    (on-table b324)
    (clear b317)
    (on-table b317)
    (clear b60)
    (on b60 b7)
    (on-table b7)
    (clear b299)
    (on-table b299)
    (clear b308)
    (on b308 b112)
    (on-table b112)
    (clear b38)
    (on-table b38)
    (clear b218)
    (on b218 b120)
    (on b120 b102)
    (on b102 b378)
    (on b378 b125)
    (on b125 b140)
    (on-table b140)
    (clear b54)
    (on-table b54)
    (clear b343)
    (on-table b343)
    (clear b92)
    (on b92 b18)
    (on-table b18)
    (clear b249)
    (on b249 b312)
    (on b312 b197)
    (on b197 b320)
    (on b320 b13)
    (on b13 b29)
    (on b29 b355)
    (on b355 b159)
    (on b159 b40)
    (on b40 b44)
    (on-table b44)
    (clear b27)
    (on b27 b103)
    (on-table b103)
    (clear b237)
    (on-table b237)
    (clear b70)
    (on-table b70)
    (clear b346)
    (on b346 b65)
    (on-table b65)
    (clear b83)
    (on b83 b148)
    (on b148 b34)
    (on b34 b221)
    (on-table b221)
    (clear b252)
    (on b252 b301)
    (on b301 b144)
    (on b144 b195)
    (on-table b195)
    (clear b46)
    (on b46 b111)
    (on b111 b180)
    (on b180 b325)
    (on b325 b290)
    (on b290 b131)
    (on b131 b362)
    (on b362 b76)
    (on b76 b72)
    (on b72 b340)
    (on b340 b365)
    (on-table b365)
    (clear b69)
    (on b69 b284)
    (on b284 b8)
    (on-table b8)
    (clear b205)
    (on b205 b328)
    (on-table b328)
    (clear b6)
    (on-table b6)
    (clear b122)
    (on b122 b149)
    (on b149 b351)
    (on b351 b152)
    (on b152 b291)
    (on-table b291)
    (clear b173)
    (on b173 b231)
    (on-table b231)
    (clear b4)
    (on b4 b108)
    (on-table b108)
    (clear b89)
    (on b89 b326)
    (on b326 b155)
    (on-table b155)
    (clear b242)
    (on b242 b82)
    (on b82 b304)
    (on-table b304)
    (clear b333)
    (on b333 b366)
    (on b366 b137)
    (on b137 b266)
    (on b266 b130)
    (on-table b130)
    (clear b277)
    (on b277 b204)
    (on-table b204)
    (clear b348)
    (on b348 b157)
    (on b157 b359)
    (on b359 b240)
    (on b240 b202)
    (on b202 b255)
    (on b255 b74)
    (on b74 b302)
    (on-table b302)
    (clear b263)
    (on-table b263)
    (clear b372)
    (on b372 b331)
    (on-table b331)
    (clear b220)
    (on b220 b1)
    (on-table b1)
    (clear b319)
    (on b319 b73)
    (on b73 b244)
    (on b244 b210)
    (on b210 b264)
    (on-table b264)
    (clear b337)
    (on b337 b26)
    (on-table b26)
    (clear b230)
    (on b230 b191)
    (on b191 b184)
    (on b184 b121)
    (on-table b121)
    (clear b84)
    (on-table b84)
    (clear b124)
    (on b124 b239)
    (on b239 b189)
    (on b189 b207)
    (on-table b207)
    (clear b354)
    (on b354 b170)
    (on b170 b175)
    (on-table b175)
    (clear b339)
    (on b339 b150)
    (on b150 b373)
    (on b373 b193)
    (on b193 b53)
    (on b53 b113)
    (on b113 b258)
    (on b258 b109)
    (on b109 b222)
    (on b222 b198)
    (on b198 b43)
    (on b43 b358)
    (on-table b358)
    (clear b262)
    (on b262 b106)
    (on b106 b129)
    (on b129 b28)
    (on-table b28)
    (clear b25)
    (on b25 b10)
    (on-table b10)
    (clear b41)
    (on b41 b75)
    (on b75 b342)
    (on b342 b71)
    (on b71 b281)
    (on b281 b123)
    (on b123 b201)
    (on b201 b200)
    (on b200 b185)
    (on b185 b375)
    (on-table b375)
    (clear b51)
    (on b51 b278)
    (on b278 b260)
    (on b260 b50)
    (on b50 b141)
    (on-table b141)
    (clear b275)
    (on b275 b110)
    (on b110 b188)
    (on b188 b341)
    (on-table b341)
    (clear b371)
    (on-table b371)
    (clear b356)
    (on b356 b257)
    (on b257 b136)
    (on-table b136)
    (clear b171)
    (on b171 b367)
    (on-table b367)
    (clear b158)
    (on-table b158)
    (clear b297)
    (on b297 b45)
    (on b45 b15)
    (on b15 b80)
    (on b80 b48)
    (on b48 b229)
    (on b229 b214)
    (on b214 b329)
    (on-table b329)
    (clear b11)
    (on b11 b282)
    (on b282 b199)
    (on b199 b369)
    (on b369 b105)
    (on-table b105)
    (clear b272)
    (on b272 b248)
    (on b248 b298)
    (on b298 b194)
    (on-table b194)
    (clear b261)
    (on b261 b274)
    (on b274 b68)
    (on b68 b360)
    (on b360 b165)
    (on b165 b81)
    (on b81 b9)
    (on b9 b100)
    (on b100 b52)
    (on-table b52)
    (clear b330)
    (on-table b330)
    (clear b19)
    (on-table b19)
    (clear b273)
    (on-table b273)
    (clear b143)
    (on b143 b161)
    (on-table b161)
    (clear b212)
    (on b212 b93)
    (on b93 b62)
    (on b62 b186)
    (on b186 b368)
    (on b368 b353)
    (on b353 b363)
    (on b363 b228)
    (on b228 b172)
    (on b172 b376)
    (on b376 b238)
    (on b238 b267)
    (on b267 b31)
    (on b31 b225)
    (on b225 b219)
    (on-table b219)
    (clear b151)
    (on b151 b315)
    (on b315 b132)
    (on b132 b280)
    (on-table b280)
    (clear b265)
    (on b265 b168)
    (on-table b168)
    (clear b167)
    (on b167 b370)
    (on-table b370)
    (clear b176)
    (on b176 b349)
    (on-table b349)
    (clear b37)
    (on-table b37)
    (clear b135)
    (on b135 b305)
    (on b305 b49)
    (on-table b49)
    (clear b55)
    (on b55 b97)
    (on b97 b57)
    (on b57 b162)
    (on-table b162)
    (clear b12)
    (on-table b12)
    (clear b232)
    (on b232 b323)
    (on b323 b35)
    (on b35 b115)
    (on b115 b177)
    (on b177 b296)
    (on-table b296)
    (clear b163)
    (on-table b163)
    (clear b247)
    (on b247 b64)
    (on b64 b310)
    (on-table b310)
    (clear b271)
    (on b271 b146)
    (on b146 b350)
    (on b350 b233)
    (on-table b233)
    (clear b286)
    (on b286 b98)
    (on b98 b101)
    (on b101 b3)
    (on b3 b85)
    (on b85 b226)
    (on b226 b216)
    (on-table b216)
    (clear b22)
    (on b22 b114)
    (on b114 b127)
    (on b127 b209)
    (on-table b209)
    (clear b42)
    (on b42 b336)
    (on b336 b295)
    (on b295 b154)
    (on b154 b223)
    (on b223 b21)
    (on b21 b77)
    (on-table b77)
    (clear b169)
    (on b169 b164)
    (on b164 b256)
    (on b256 b96)
    (on-table b96)
    (clear b234)
    (on b234 b156)
    (on b156 b224)
    (on b224 b179)
    (on b179 b5)
    (on b5 b268)
    (on b268 b203)
    (on-table b203)
    (clear b357)
    (on b357 b306)
    (on b306 b303)
    (on b303 b377)
    (on b377 b236)
    (on-table b236)
    (clear b145)
    (on-table b145)
    (clear b332)
    (on-table b332)
    (clear b20)
    (on b20 b283)
    (on b283 b276)
    (on b276 b292)
    (on b292 b294)
    (on b294 b32)
    (on b32 b91)
    (on b91 b285)
    (on b285 b289)
    (on b289 b300)
    (on b300 b293)
    (on-table b293)
    (clear b182)
    (on b182 b259)
    (on-table b259)
    (clear b250)
    (on b250 b314)
    (on-table b314)
    (clear b253)
    (on b253 b16)
    (on b16 b213)
    (on b213 b94)
    (on b94 b61)
    (on b61 b183)
    (on b183 b270)
    (on b270 b192)
    (on b192 b58)
    (on-table b58)
    (clear b313)
    (on b313 b2)
    (on b2 b88)
    (on b88 b217)
    (on b217 b86)
    (on-table b86)
    (clear b251)
    (on b251 b311)
    (on b311 b254)
    (on b254 b117)
    (on b117 b59)
    (on-table b59))
 (:goal  (and 
    (clear b2)
    (on-table b2)
    (clear b9)
    (on-table b9)
    (clear b10)
    (on b10 b1)
    (on-table b1)
    (clear b7)
    (on b7 b4)
    (on-table b4)
    (clear b5)
    (on b5 b6)
    (on-table b6)
    (clear b3)
    (on b3 b11)
    (on b11 b8)
    (on-table b8))))

; plan
1. (unstack b4 b108)
   deleted: (on b4 b108) (clear b4) (arm-empty)
   added: (holding b4) (clear b108)
   goals met: 3 of 17
2. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 17
3. (unstack b220 b1)
   deleted: (on b220 b1) (clear b220) (arm-empty)
   added: (holding b220) (clear b1)
   goals met: 4 of 17
4. (putdown b220)
   deleted: (holding b220)
   added: (clear b220) (arm-empty) (on-table b220)
   goals met: 4 of 17
5. (unstack b234 b156)
   deleted: (on b234 b156) (clear b234) (arm-empty)
   added: (holding b234) (clear b156)
   goals met: 4 of 17
6. (putdown b234)
   deleted: (holding b234)
   added: (clear b234) (arm-empty) (on-table b234)
   goals met: 4 of 17
7. (unstack b156 b224)
   deleted: (on b156 b224) (clear b156) (arm-empty)
   added: (holding b156) (clear b224)
   goals met: 4 of 17
8. (putdown b156)
   deleted: (holding b156)
   added: (clear b156) (arm-empty) (on-table b156)
   goals met: 4 of 17
9. (unstack b224 b179)
   deleted: (on b224 b179) (clear b224) (arm-empty)
   added: (holding b224) (clear b179)
   goals met: 4 of 17
10. (putdown b224)
   deleted: (holding b224)
   added: (clear b224) (arm-empty) (on-table b224)
   goals met: 4 of 17
11. (unstack b179 b5)
   deleted: (on b179 b5) (clear b179) (arm-empty)
   added: (holding b179) (clear b5)
   goals met: 5 of 17
12. (putdown b179)
   deleted: (holding b179)
   added: (clear b179) (arm-empty) (on-table b179)
   goals met: 5 of 17
13. (unstack b25 b10)
   deleted: (on b25 b10) (clear b25) (arm-empty)
   added: (holding b25) (clear b10)
   goals met: 6 of 17
14. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 6 of 17
15. (unstack b261 b274)
   deleted: (on b261 b274) (clear b261) (arm-empty)
   added: (holding b261) (clear b274)
   goals met: 6 of 17
16. (putdown b261)
   deleted: (holding b261)
   added: (clear b261) (arm-empty) (on-table b261)
   goals met: 6 of 17
17. (unstack b274 b68)
   deleted: (on b274 b68) (clear b274) (arm-empty)
   added: (holding b274) (clear b68)
   goals met: 6 of 17
18. (putdown b274)
   deleted: (holding b274)
   added: (clear b274) (arm-empty) (on-table b274)
   goals met: 6 of 17
19. (unstack b286 b98)
   deleted: (on b286 b98) (clear b286) (arm-empty)
   added: (holding b286) (clear b98)
   goals met: 6 of 17
20. (putdown b286)
   deleted: (holding b286)
   added: (clear b286) (arm-empty) (on-table b286)
   goals met: 6 of 17
21. (unstack b313 b2)
   deleted: (on b313 b2) (clear b313) (arm-empty)
   added: (holding b313) (clear b2)
   goals met: 7 of 17
22. (putdown b313)
   deleted: (holding b313)
   added: (clear b313) (arm-empty) (on-table b313)
   goals met: 7 of 17
23. (unstack b2 b88)
   deleted: (on b2 b88) (clear b2) (arm-empty)
   added: (holding b2) (clear b88)
   goals met: 6 of 17
24. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 8 of 17
25. (unstack b60 b7)
   deleted: (on b60 b7) (clear b60) (arm-empty)
   added: (holding b60) (clear b7)
   goals met: 9 of 17
26. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 9 of 17
27. (unstack b68 b360)
   deleted: (on b68 b360) (clear b68) (arm-empty)
   added: (holding b68) (clear b360)
   goals met: 9 of 17
28. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 9 of 17
29. (unstack b360 b165)
   deleted: (on b360 b165) (clear b360) (arm-empty)
   added: (holding b360) (clear b165)
   goals met: 9 of 17
30. (putdown b360)
   deleted: (holding b360)
   added: (clear b360) (arm-empty) (on-table b360)
   goals met: 9 of 17
31. (unstack b165 b81)
   deleted: (on b165 b81) (clear b165) (arm-empty)
   added: (holding b165) (clear b81)
   goals met: 9 of 17
32. (putdown b165)
   deleted: (holding b165)
   added: (clear b165) (arm-empty) (on-table b165)
   goals met: 9 of 17
33. (unstack b69 b284)
   deleted: (on b69 b284) (clear b69) (arm-empty)
   added: (holding b69) (clear b284)
   goals met: 9 of 17
34. (putdown b69)
   deleted: (holding b69)
   added: (clear b69) (arm-empty) (on-table b69)
   goals met: 9 of 17
35. (unstack b284 b8)
   deleted: (on b284 b8) (clear b284) (arm-empty)
   added: (holding b284) (clear b8)
   goals met: 9 of 17
36. (putdown b284)
   deleted: (holding b284)
   added: (clear b284) (arm-empty) (on-table b284)
   goals met: 9 of 17
37. (unstack b81 b9)
   deleted: (on b81 b9) (clear b81) (arm-empty)
   added: (holding b81) (clear b9)
   goals met: 10 of 17
38. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 10 of 17
39. (unstack b9 b100)
   deleted: (on b9 b100) (clear b9) (arm-empty)
   added: (holding b9) (clear b100)
   goals met: 9 of 17
40. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 11 of 17
41. (unstack b98 b101)
   deleted: (on b98 b101) (clear b98) (arm-empty)
   added: (holding b98) (clear b101)
   goals met: 11 of 17
42. (putdown b98)
   deleted: (holding b98)
   added: (clear b98) (arm-empty) (on-table b98)
   goals met: 11 of 17
43. (unstack b101 b3)
   deleted: (on b101 b3) (clear b101) (arm-empty)
   added: (holding b101) (clear b3)
   goals met: 12 of 17
44. (putdown b101)
   deleted: (holding b101)
   added: (clear b101) (arm-empty) (on-table b101)
   goals met: 12 of 17
45. (unstack b11 b282)
   deleted: (on b11 b282) (clear b11) (arm-empty)
   added: (holding b11) (clear b282)
   goals met: 12 of 17
46. (stack b11 b8)
   deleted: (clear b8) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b8)
   goals met: 13 of 17
47. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 12 of 17
48. (stack b10 b1)
   deleted: (clear b1) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b1)
   goals met: 14 of 17
49. (unstack b3 b85)
   deleted: (on b3 b85) (clear b3) (arm-empty)
   added: (holding b3) (clear b85)
   goals met: 13 of 17
50. (stack b3 b11)
   deleted: (clear b11) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b11)
   goals met: 15 of 17
51. (unstack b5 b268)
   deleted: (on b5 b268) (clear b5) (arm-empty)
   added: (holding b5) (clear b268)
   goals met: 14 of 17
52. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 16 of 17
53. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 15 of 17
54. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 17 of 17
